src/test/resources/requestSOAP.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://maxintech.com/bank/ws">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:createAccountRequest>
         <gs:name>RandomAccount09</gs:name>
         <gs:balance>320</gs:balance>
      </gs:createAccountRequest>
   </soapenv:Body>
</soapenv:Envelope>